app/controllers/drinks_controller.rb

  def create
    @drink = Drink.new(drink_params)
    if @drink.save
---
INSERT INTO "drinks" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def index
    @drinks = Drink.all
---
SELECT "drinks".* FROM "drinks"

  def destroy
    @drink = Drink.find params[:id]
    @drink.destroy
---
SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = $1 LIMIT 1  [["id", 18]]
DELETE FROM "drinks" WHERE "drinks"."id" = $1  [["id", 18]]